StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/hal_halmac.c
/******************************************************************************
 *
 * Copyright(c) 2015 - 2019 Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/
#define _HAL_HALMAC_C_

#include <drv_types.h>		/* PADAPTER, struct dvobj_priv, SDIO_ERR_VAL8 and etc. */
#include <hal_data.h>		/* efuse, PHAL_DATA_TYPE and etc. */
#include "hal_halmac.h"		/* dvobj_to_halmac() and ect. */
#include "rtl8730a/hal8730a_fw.h"

/*
 * HALMAC take return value 0 for fail and 1 for success to replace
 * _FALSE/_TRUE after V1_04_09
 */
#define RTW_HALMAC_FAIL			0
#define RTW_HALMAC_SUCCESS		1

#define DEFAULT_INDICATOR_TIMELMT	1000	/* ms */
#define MSG_PREFIX			"[HALMAC]"

#define RTW_HALMAC_FILTER_DRV_C2H	/* Block C2H owner=driver */

/*
 * Driver API for HALMAC operations
 */

static u8 _halmac_reg_read_8(void *p, u32 offset)
{
	struct dvobj_priv *d;
	PADAPTER adapter;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	return _rtw_read8(adapter, offset);
}

static u16 _halmac_reg_read_16(void *p, u32 offset)
{
	struct dvobj_priv *d;
	PADAPTER adapter;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	return _rtw_read16(adapter, offset);
}

static u32 _halmac_reg_read_32(void *p, u32 offset)
{
	struct dvobj_priv *d;
	PADAPTER adapter;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	return _rtw_read32(adapter, offset);
}

static void _halmac_reg_write_8(void *p, u32 offset, u8 val)
{
	struct dvobj_priv *d;
	PADAPTER adapter;
	int err;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	err = _rtw_write8(adapter, offset, val);
	if (err == _FAIL) {
		RTW_ERR("%s: I/O FAIL!\n", __FUNCTION__);
	}
}

static void _halmac_reg_write_16(void *p, u32 offset, u16 val)
{
	struct dvobj_priv *d;
	PADAPTER adapter;
	int err;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	err = _rtw_write16(adapter, offset, val);
	if (err == _FAIL) {
		RTW_ERR("%s: I/O FAIL!\n", __FUNCTION__);
	}
}

static void _halmac_reg_write_32(void *p, u32 offset, u32 val)
{
	struct dvobj_priv *d;
	PADAPTER adapter;
	int err;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	err = _rtw_write32(adapter, offset, val);
	if (err == _FAIL) {
		RTW_ERR("%s: I/O FAIL!\n", __FUNCTION__);
	}
}

static u8 _halmac_sys_reg_read_8(void *p, u32 base, u32 offset)
{
	struct dvobj_priv *d;
	PADAPTER adapter;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	return _rtw_sys_read8(adapter, base, offset);
}

static u16 _halmac_sys_reg_read_16(void *p, u32 base, u32 offset)
{
	struct dvobj_priv *d;
	PADAPTER adapter;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	return _rtw_sys_read16(adapter, base, offset);
}

static u32 _halmac_sys_reg_read_32(void *p, u32 base, u32 offset)
{
	struct dvobj_priv *d;
	PADAPTER adapter;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	return _rtw_sys_read32(adapter, base, offset);
}

static void _halmac_sys_reg_write_8(void *p, u32 base, u32 offset, u8 val)
{
	struct dvobj_priv *d;
	PADAPTER adapter;
	int err;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	err = _rtw_sys_write8(adapter, base, offset, val);
	if (err == _FAIL) {
		RTW_ERR("%s: I/O FAIL!\n", __FUNCTION__);
	}
}

static void _halmac_sys_reg_write_16(void *p, u32 base, u32 offset, u16 val)
{
	struct dvobj_priv *d;
	PADAPTER adapter;
	int err;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	err = _rtw_sys_write16(adapter, base, offset, val);
	if (err == _FAIL) {
		RTW_ERR("%s: I/O FAIL!\n", __FUNCTION__);
	}
}

static void _halmac_sys_reg_write_32(void *p, u32 base, u32 offset, u32 val)
{
	struct dvobj_priv *d;
	PADAPTER adapter;
	int err;


	d = (struct dvobj_priv *)p;
	adapter = dvobj_get_primary_adapter(d);

	err = _rtw_sys_write32(adapter, base, offset, val);
	if (err == _FAIL) {
		RTW_ERR("%s: I/O FAIL!\n", __FUNCTION__);
	}
}

#ifdef DBG_IO
static void _halmac_reg_read_monitor(void *p, u32 addr, u32 len, u32 val
				     , const char *caller, const u32 line)
{
	struct dvobj_priv *d = (struct dvobj_priv *)p;
	_adapter *adapter = dvobj_get_primary_adapter(d);

	dbg_rtw_reg_read_monitor(adapter, addr, len, val, caller, line);
}

static void _halmac_reg_write_monitor(void *p, u32 addr, u32 len, u32 val
				      , const char *caller, const u32 line)
{
	struct dvobj_priv *d = (struct dvobj_priv *)p;
	_adapter *adapter = dvobj_get_primary_adapter(d);

	dbg_rtw_reg_write_monitor(adapter, addr, len, val, caller, line);
}
#endif

static u8 _halmac_mfree(void *p, void *buffer, u32 size)
{
	rtw_mfree(buffer, size);
	return RTW_HALMAC_SUCCESS;
}

static void *_halmac_malloc(void *p, u32 size)
{
	return rtw_zmalloc(size);
}

static u8 _halmac_memcpy(void *p, void *dest, void *src, u32 size)
{
	_rtw_memcpy(dest, src, size);
	return RTW_HALMAC_SUCCESS;
}

static u8 _halmac_memset(void *p, void *addr, u8 value, u32 size)
{
	_rtw_memset(addr, value, size);
	return RTW_HALMAC_SUCCESS;
}

static void _halmac_udelay(void *p, u32 us)
{
	/* Most hardware polling wait time < 50us) */
	if (us <= 50) {
		rtw_udelay_os(us);
	} else if (us <= 1000) {
		rtw_usleep_os(us);
	} else {
		rtw_msleep_os(RTW_DIV_ROUND_UP(us, 1000));
	}
}

static u8 _halmac_mutex_init(void *p, HALMAC_MUTEX *pMutex)
{
	_rtw_mutex_init(pMutex);
	return RTW_HALMAC_SUCCESS;
}

static u8 _halmac_mutex_deinit(void *p, HALMAC_MUTEX *pMutex)
{
	_rtw_mutex_free(pMutex);
	return RTW_HALMAC_SUCCESS;
}

static u8 _halmac_mutex_lock(void *p, HALMAC_MUTEX *pMutex)
{
	int err;

	err = _enter_critical_mutex(pMutex, NULL);
	if (err) {
		return RTW_HALMAC_FAIL;
	}

