StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/hal_halmac.c
exit:
	if (err)
		RTW_ERR("%s: Fail to enter sleep mode! (%d, %d)\n",
			__FUNCTION__, status, mode);

	RTW_INFO("%s: Cost %dms to polling %u times. (err=%d)\n",
		 __FUNCTION__, period, cnt, err);

	return err;
}

static void _init_trx_cfg_drv(struct dvobj_priv *d)
{
#ifdef CONFIG_AXI_HCI
	rtw_hal_irp_reset(dvobj_get_primary_adapter(d));
#endif
}

static int init_mac_flow(struct dvobj_priv *d)
{
	PADAPTER p;
	struct hal_com_data *hal;
	struct halmac_adapter *halmac;
	struct halmac_api *api;
	enum halmac_drv_rsvd_pg_num rsvd_page_number;
	union halmac_wlan_addr hwa;
	enum halmac_trx_mode trx_mode;
	enum halmac_ret_status status;
	u8 drv_rsvd_num;
	u8 nettype;
	int err, err_ret = -1;


	p = dvobj_get_primary_adapter(d);
	hal = GET_HAL_DATA(p);
	halmac = dvobj_to_halmac(d);
	api = HALMAC_GET_API(halmac);

#ifdef CONFIG_SUPPORT_TRX_SHARED
	status = api->halmac_cfg_rxff_expand_mode(halmac,
			_rtw_get_trx_share_mode(p));
	if (status != HALMAC_RET_SUCCESS) {
		goto out;
	}
#endif

#ifdef DBG_LA_MODE
	if (dvobj_to_regsty(d)->la_mode_en) {
		status = api->halmac_cfg_la_mode(halmac, HALMAC_LA_MODE_PARTIAL);
		if (status != HALMAC_RET_SUCCESS) {
			RTW_ERR("%s: Fail to enable LA mode!\n", __FUNCTION__);
			goto out;
		}
		RTW_PRINT("%s: Enable LA mode OK.\n", __FUNCTION__);
	}
#endif

	err = _cfg_drv_rsvd_pg_num(d);
	if (err) {
		goto out;
	}

	trx_mode = _choose_trx_mode(d);
	status = api->halmac_init_mac_cfg(halmac, trx_mode);
	if (status != HALMAC_RET_SUCCESS) {
		goto out;
	}

	/* Driver insert flow: Sync driver setting with register */
	/* Sync driver RCR cache with register setting */
	rtw_hal_get_hwreg(dvobj_get_primary_adapter(d), HW_VAR_RCR, NULL);

#ifdef CONFIG_RTS_FULL_BW
	err = rtw_halmac_set_rts_full_bw(d, _TRUE);
	if (err) {
		RTW_WARN("%s: Fail to set RTS FULL BW mode\n", __FUNCTION__);
	}
#else
	err = rtw_halmac_set_rts_full_bw(d, _FALSE);
	if (err) {
		RTW_WARN("%s: Fail to disable RTS FULL BW mode\n", __FUNCTION__);
	}
#endif /* CONFIG_RTS_FULL_BW */

	_init_trx_cfg_drv(d);
	/* Driver inser flow end */

	err = rtw_halmac_rx_agg_switch(d, _TRUE);
	if (err) {
		goto out;
	}

	nettype = dvobj_to_regsty(d)->wireless_mode;
	if (is_supported_vht(nettype) == _TRUE) {
		status = api->halmac_cfg_operation_mode(halmac, HALMAC_WIRELESS_MODE_AC);
	} else if (is_supported_ht(nettype) == _TRUE) {
		status = api->halmac_cfg_operation_mode(halmac, HALMAC_WIRELESS_MODE_N);
	} else if (IsSupportedTxOFDM(nettype) == _TRUE) {
		status = api->halmac_cfg_operation_mode(halmac, HALMAC_WIRELESS_MODE_G);
	} else {
		status = api->halmac_cfg_operation_mode(halmac, HALMAC_WIRELESS_MODE_B);
	}
	if (status != HALMAC_RET_SUCCESS) {
		goto out;
	}

	err_ret = 0;
out:
	return err_ret;
}

static int _drv_enable_trx(struct dvobj_priv *d)
{
	struct _ADAPTER *adapter;
	u32 status;


	adapter = dvobj_get_primary_adapter(d);
	if (adapter->bup == _FALSE) {
#ifdef CONFIG_NEW_NETDEV_HDL
		status = rtw_mi_start_drv_threads(adapter);
#else
		status = rtw_start_drv_threads(adapter);
#endif
		if (status == _FAIL) {
			RTW_ERR("%s: Start threads Failed!\n", __FUNCTION__);
			return -1;
		}
	}

	rtw_intf_start(adapter);

	return 0;
}

/*
 * Notices:
 *	Make sure following information
 *	1. GET_HAL_RFPATH
 *	2. GET_HAL_DATA(dvobj_get_primary_adapter(d))->rfe_type
 *	3. GET_HAL_DATA(dvobj_get_primary_adapter(d))->PackageType
 *	4. dvobj_get_primary_adapter(d)->registrypriv.mp_mode
 *	are all ready before calling this function.
 */
static int _halmac_init_hal(struct dvobj_priv *d)
{
	PADAPTER adapter;
	struct halmac_adapter *halmac;
	struct halmac_api *api;
	enum halmac_ret_status status;
	u32 ok;
	u8 fw_ok = _FALSE;
	int err, err_ret = -1;

	adapter = dvobj_get_primary_adapter(d);
	halmac = dvobj_to_halmac(d);
	if (!halmac) {
		goto out;
	}
	api = HALMAC_GET_API(halmac);

	/* StatePowerOff */

	/* SKIP: halmac_init_adapter (Already done before) */

	/* halmac_pre_Init_system_cfg */
	/* halmac_mac_power_switch(on) */
	/* halmac_Init_system_cfg */
	ok = rtw_hal_power_on(adapter);
	if (_FAIL == ok) {
		goto out;
	}

	/* StatePowerOn */

	/* Enable FW */
	err = rtl8730a_FirmwareEnable(adapter, 1);
	if (err) {
		goto out;
	}
	fw_ok = _TRUE;

	/* InitMACFlow */
	err = init_mac_flow(d);
	if (err) {
		goto out;
	}

	/* Driver insert flow: Enable TR/RX */
	err = _drv_enable_trx(d);
	if (err) {
		goto out;
	}

	/* halmac_send_general_info */
	if (_TRUE == fw_ok) {
		err = _send_general_info(d);
		if (err) {
			goto out;
		}
	}

	/* Init Phy parameter-MAC */
	ok = rtw_hal_init_mac_register(adapter);
	if (_FALSE == ok) {
		goto out;
	}

	/* StateMacInitialized */

	/* halmac_cfg_drv_info */
	err = rtw_halmac_config_rx_info(d, HALMAC_DRV_INFO_PHY_STATUS);
	if (err) {
		goto out;
	}

	/* halmac_set_hw_value(HALMAC_HW_EN_BB_RF) */
	/* Init BB, RF */
	ok = rtw_hal_init_phy(adapter);
	if (_FALSE == ok) {
		goto out;
	}

	status = api->halmac_init_interface_cfg(halmac);
	if (status != HALMAC_RET_SUCCESS) {
		goto out;
	}

	/* SKIP: halmac_verify_platform_api */
	/* SKIP: halmac_h2c_lb */

	/* StateRxIdle */

	err_ret = 0;
out:
	return err_ret;
}

int rtw_halmac_init_hal(struct dvobj_priv *d)
{
	return _halmac_init_hal(d);
}

int rtw_halmac_deinit_hal(struct dvobj_priv *d)
{
	PADAPTER adapter;
	struct halmac_adapter *halmac;
	struct halmac_api *api;
	enum halmac_ret_status status;
	int err = -1;


	adapter = dvobj_get_primary_adapter(d);
	halmac = dvobj_to_halmac(d);
	if (!halmac) {
		goto out;
	}
	api = HALMAC_GET_API(halmac);

	status = api->halmac_deinit_interface_cfg(halmac);
	if (status != HALMAC_RET_SUCCESS) {
		goto out;
	}

	/* Disable FW */
	err = rtl8730a_FirmwareEnable(adapter, 0);
	if (err) {
		goto out;
	}

	rtw_hal_power_off(adapter);

	err = 0;
out:
	return err;
}

int rtw_halmac_self_verify(struct dvobj_priv *d)
{
	struct halmac_adapter *mac;
	struct halmac_api *api;
	enum halmac_ret_status status;
	int err = -1;


	mac = dvobj_to_halmac(d);
	api = HALMAC_GET_API(mac);

	status = api->halmac_verify_platform_api(mac);
	if (status != HALMAC_RET_SUCCESS) {
		goto out;
	}

	status = api->halmac_h2c_lb(mac);
	if (status != HALMAC_RET_SUCCESS) {
		goto out;
	}

	err = 0;
out:
	return err;
}

static u8 rtw_halmac_txfifo_is_empty(struct dvobj_priv *d)
{
	struct halmac_adapter *mac;
	struct halmac_api *api;
	enum halmac_ret_status status;
	u32 chk_num = 10;
	u8 rst = _FALSE;


	mac = dvobj_to_halmac(d);
	api = HALMAC_GET_API(mac);

	status = api->halmac_txfifo_is_empty(mac, chk_num);
	if (status == HALMAC_RET_SUCCESS) {
		rst = _TRUE;
	}

	return rst;
}

/**
 * rtw_halmac_txfifo_wait_empty() - Wait TX FIFO to be emtpy
 * @d:		struct dvobj_priv*
 * @timeout:	time limit of wait, unit is ms
 *		0 for no limit
 *
 * Wait TX FIFO to be emtpy.
 *
 * Return 0 for TX FIFO is empty, otherwise not empty.
 */
int rtw_halmac_txfifo_wait_empty(struct dvobj_priv *d, u32 timeout)
{
	struct _ADAPTER *a;
	u8 empty = _FALSE;
	u32 cnt = 0;
	systime start_time = 0;
	u32 pass_time; /* ms */


	a = dvobj_get_primary_adapter(d);
	start_time = rtw_get_current_time();

	do {
		cnt++;
		empty = rtw_halmac_txfifo_is_empty(d);
		if (empty == _TRUE) {
			break;
		}

