StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/hal_halmac.c
		if (timeout) {
			pass_time = rtw_get_passing_time_ms(start_time);
			if (pass_time > timeout) {
				break;
			}
		}
		if (RTW_CANNOT_IO(a)) {
			RTW_WARN("%s: Interrupted by I/O forbiden!\n", __FUNCTION__);
			break;
		}

		rtw_msleep_os(2);
	} while (1);

	if (empty == _FALSE) {
#ifdef CONFIG_RTW_DEBUG
		u16 dbg_reg[] = {0x210, 0x230, 0x234, 0x238, 0x23C, 0x240,
				 0x418, 0x10FC, 0x10F8, 0x11F4, 0x11F8
				};
		u8 i;
		u32 val;

		if (!RTW_CANNOT_IO(a)) {
			for (i = 0; i < ARRAY_SIZE(dbg_reg); i++) {
				val = rtw_read32(a, dbg_reg[i]);
				RTW_ERR("REG_%X:0x%08x\n", dbg_reg[i], val);
			}
		}
#endif /* CONFIG_RTW_DEBUG */

		RTW_ERR("%s: Fail to wait txfifo empty!(cnt=%d)\n",
			__FUNCTION__, cnt);
		return -1;
	}

	return 0;
}

static enum halmac_dlfw_mem _fw_mem_drv2halmac(enum fw_mem mem, u8 tx_stop)
{
	enum halmac_dlfw_mem mem_halmac = HALMAC_DLFW_MEM_UNDEFINE;


	switch (mem) {
	case FW_EMEM:
		if (tx_stop == _FALSE) {
			mem_halmac = HALMAC_DLFW_MEM_EMEM_RSVD_PG;
		} else {
			mem_halmac = HALMAC_DLFW_MEM_EMEM;
		}
		break;

	case FW_IMEM:
	case FW_DMEM:
		mem_halmac = HALMAC_DLFW_MEM_UNDEFINE;
		break;
	}

	return mem_halmac;
}

/*
 * Description:
 *	Power on/off BB/RF domain.
 *
 * Parameters:
 *	enable	_TRUE/_FALSE for power on/off
 *
 * Return:
 *	0	Success
 *	others	Fail
 */
int rtw_halmac_phy_power_switch(struct dvobj_priv *d, u8 enable)
{
	PADAPTER adapter;
	struct halmac_adapter *halmac;
	struct halmac_api *api;
	enum halmac_ret_status status;
	u8 on;


	adapter = dvobj_get_primary_adapter(d);
	halmac = dvobj_to_halmac(d);
	if (!halmac) {
		return -1;
	}
	api = HALMAC_GET_API(halmac);
	on = (enable == _TRUE) ? 1 : 0;

	status = api->halmac_set_hw_value(halmac, HALMAC_HW_EN_BB_RF, &on);
	if (status != HALMAC_RET_SUCCESS) {
		return -1;
	}

	return 0;
}

static u8 _is_fw_read_cmd_down(PADAPTER adapter, u8 msgbox_num)
{
	u8 read_down = _FALSE;
	int retry_cnts = 100;
	u8 valid;

	do {
		valid = rtw_read8(adapter, REG_HMETFR) & BIT(msgbox_num);
		if (0 == valid) {
			read_down = _TRUE;
		} else {
			rtw_msleep_os(1);
		}
	} while ((!read_down) && (retry_cnts--));

	if (_FALSE == read_down) {
		RTW_WARN("%s, reg_1cc(%x), msg_box(%d)...\n", __func__, rtw_read8(adapter, REG_HMETFR), msgbox_num);
	}

	return read_down;
}

/**
 * rtw_halmac_send_h2c() - Send H2C to firmware
 * @d:		struct dvobj_priv*
 * @h2c:	H2C data buffer, suppose to be 8 bytes
 *
 * Send H2C to firmware by message box register(0x1D0~0x1D3 & 0x1F0~0x1F3).
 *
 * Assume firmware be ready to accept H2C here, please check
 * (hal->bFWReady == _TRUE) before call this function or make sure firmware is
 * ready.
 *
 * Return: 0 if process OK, otherwise fail to send this H2C.
 */
int rtw_halmac_send_h2c(struct dvobj_priv *d, u8 *h2c)
{
	PADAPTER adapter = dvobj_get_primary_adapter(d);
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);
	u8 h2c_box_num = 0;
	u32 msgbox_addr = 0;
	u32 msgbox_ex_addr = 0;
	u32 h2c_cmd = 0;
	u32 h2c_cmd_ex = 0;
	int err = -1;


	if (!h2c) {
		RTW_WARN("%s: pbuf is NULL\n", __FUNCTION__);
		return err;
	}

	if (rtw_is_surprise_removed(adapter)) {
		RTW_WARN("%s: surprise removed\n", __FUNCTION__);
		return err;
	}

	_enter_critical_mutex(&d->h2c_fwcmd_mutex, NULL);

	/* pay attention to if race condition happened in H2C cmd setting */
	h2c_box_num = hal->LastHMEBoxNum;

	if (!_is_fw_read_cmd_down(adapter, h2c_box_num)) {
		RTW_WARN(" fw read cmd failed...\n");
#ifdef DBG_CONFIG_ERROR_DETECT
		hal->srestpriv.self_dect_fw = _TRUE;
		hal->srestpriv.self_dect_fw_cnt++;
#endif /* DBG_CONFIG_ERROR_DETECT */
		goto exit;
	}

	/* Write Ext command (byte 4~7) */
	msgbox_ex_addr = REG_HMEBOX_E0 + (h2c_box_num * EX_MESSAGE_BOX_SIZE);
	_rtw_memcpy((u8 *)(&h2c_cmd_ex), h2c + 4, EX_MESSAGE_BOX_SIZE);
	h2c_cmd_ex = le32_to_cpu(h2c_cmd_ex);
	rtw_write32(adapter, msgbox_ex_addr, h2c_cmd_ex);

	/* Write command (byte 0~3) */
	msgbox_addr = REG_HMEBOX0 + (h2c_box_num * MESSAGE_BOX_SIZE);
	_rtw_memcpy((u8 *)(&h2c_cmd), h2c, 4);
	h2c_cmd = le32_to_cpu(h2c_cmd);
	rtw_write32(adapter, msgbox_addr, h2c_cmd);

	/* update last msg box number */
	hal->LastHMEBoxNum = (h2c_box_num + 1) % MAX_H2C_BOX_NUMS;
	err = 0;

#ifdef DBG_H2C_CONTENT
	RTW_INFO_DUMP("[H2C] - ", h2c, RTW_HALMAC_H2C_MAX_SIZE);
#endif
exit:
	_exit_critical_mutex(&d->h2c_fwcmd_mutex, NULL);
	return err;
}

/**
 * rtw_halmac_c2h_handle() - Handle C2H for HALMAC
 * @d:		struct dvobj_priv*
 * @c2h:	Full C2H packet, including RX description and payload
 * @size:	Size(byte) of c2h
 *
 * Send C2H packet to HALMAC to process C2H packets, and the expected C2H ID is
 * 0xFF. This function won't have any I/O, so caller doesn't have to call it in
 * I/O safe place(ex. command thread).
 *
 * Please sure doesn't call this function in the same thread as someone is
 * waiting HALMAC C2H ack, otherwise there is a deadlock happen.
 *
 * Return: 0 if process OK, otherwise no action for this C2H.
 */
int rtw_halmac_c2h_handle(struct dvobj_priv *d, u8 *c2h, u32 size)
{
	struct halmac_adapter *mac;
	struct halmac_api *api;
	enum halmac_ret_status status;
#ifdef RTW_HALMAC_FILTER_DRV_C2H
	u32 desc_size = 0;
	u8 *c2h_data;
	u8 sub;
#endif /* RTW_HALMAC_FILTER_DRV_C2H */


	mac = dvobj_to_halmac(d);
	api = HALMAC_GET_API(mac);

#ifdef RTW_HALMAC_FILTER_DRV_C2H
	status = api->halmac_get_hw_value(mac, HALMAC_HW_RX_DESC_SIZE,
					  &desc_size);
	if (status != HALMAC_RET_SUCCESS) {
		RTW_ERR("%s: fail to get rx desc size!\n", __FUNCTION__);
		goto skip_filter;
	}

	c2h_data = c2h + desc_size;
	sub = C2H_HDR_GET_C2H_SUB_CMD_ID(c2h_data);
	switch (sub) {
	case C2H_SUB_CMD_ID_C2H_PKT_FTM_DBG:
	case C2H_SUB_CMD_ID_C2H_PKT_FTM_2_DBG:
	case C2H_SUB_CMD_ID_C2H_PKT_FTM_3_DBG:
	case C2H_SUB_CMD_ID_C2H_PKT_FTM_4_DBG:
	case C2H_SUB_CMD_ID_FTMACKRPT_HDL_DBG:
	case C2H_SUB_CMD_ID_FTMC2H_RPT:
	case C2H_SUB_CMD_ID_DRVFTMC2H_RPT:
	case C2H_SUB_CMD_ID_C2H_PKT_FTM_5_DBG:
	case C2H_SUB_CMD_ID_CCX_RPT:
	case C2H_SUB_CMD_ID_C2H_PKT_NAN_RPT:
	case C2H_SUB_CMD_ID_C2H_PKT_ATM_RPT:
	case C2H_SUB_CMD_ID_C2H_PKT_SCC_CSA_RPT:
	case C2H_SUB_CMD_ID_C2H_PKT_FW_STATUS_NOTIFY:
	case C2H_SUB_CMD_ID_C2H_PKT_FTMSESSION_END:
	case C2H_SUB_CMD_ID_C2H_PKT_DETECT_THERMAL:
	case C2H_SUB_CMD_ID_FW_FWCTRL_RPT:
	case C2H_SUB_CMD_ID_SCAN_CH_NOTIFY:
	case C2H_SUB_CMD_ID_FW_TBTT_RPT:
	case C2H_SUB_CMD_ID_BCN_OFFLOAD:
	case C2H_SUB_CMD_ID_FW_DBG_MSG:
		RTW_PRINT("%s: unhandled C2H, id=0xFF subid=0x%x len=%u\n",
			  __FUNCTION__, sub, C2H_HDR_GET_LEN(c2h_data));
		RTW_PRINT_DUMP("C2H: ", c2h_data, size - desc_size);
		return 0;
	}

skip_filter:
#endif /* RTW_HALMAC_FILTER_DRV_C2H */

	status = api->halmac_get_c2h_info(mac, c2h, size);
	if (HALMAC_RET_SUCCESS != status) {
		return -1;
	}

